{
  "metadata": {
    "schema_version": "1.0",
    "assessment_date": "2026-01-31",
    "notes": "Backfill of all existing resources from summarized_resources.md, paid_resources.md, and evaluated_resources.md"
  },
  "resources": [
    {
      "title": "Everything You Need to Know about AI",
      "url": "https://www.productmanagement.ai/p/everything-about-ai",
      "category": "ai-fundamentals",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2025-12-06",
      "last_verified": "2026-01-22",
      "next_review": "2027-01-22",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This comprehensive guide covers foundational AI concepts and practical applications for building AI products. It explains the four-layer hierarchy of intelligence (representation, generalization, reasoning, and agency), learning paradigms (supervised, unsupervised, reinforcement learning), neural network architectures (CNNs, RNNs, Transformers), and generative systems. The guide progresses to applied knowledge covering agent systems, scaling laws, emergence phenomena, and alignment challenges.\n\nThe latter chapters focus on real-world implementation, detailing the eight-layer AI system stack necessary for reliable products: input sanitation, retrieval, model invocation, orchestration, safety constraints, memory systems, evaluation, and drift monitoring. It positions PMs as systems architects who must understand probabilistic thinking, data curation, constraint design, and behavioral governance."
    },
    {
      "title": "PMF For AI Products",
      "url": "https://www.productmanagement.ai/p/pmf-for-ai-products",
      "category": "ai-product-strategy",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2025-12-11",
      "last_verified": "2026-01-22",
      "next_review": "2027-01-22",
      "confidence": 4,
      "author": "Miqdad Jaffer",
      "source": "productmanagement.ai",
      "summary": "This article by Miqdad Jaffer (OpenAI's Product Lead) argues that traditional product-market fit frameworks are obsolete for AI companies. It introduces the \"AI PMF Paradox\"—achieving fit is simultaneously easier (faster iteration, better user understanding) and harder (skyrocketing expectations, comparison to ChatGPT). The piece presents a four-phase framework: Opportunity Spotting, Building MVPs, Scaling with Strategic Frameworks, and Optimizing for Sustainable Growth.\n\nThe author emphasizes that AI products differ fundamentally from traditional software because problems evolve as users learn capabilities, the solution space is infinite, and user expectations compound exponentially. Success requires dual metrics—traditional engagement indicators alongside AI-specific measures like accuracy and hallucination rates. AI PMF is a moving target requiring constant recalibration."
    },
    {
      "title": "Full AI Product Cycle",
      "url": "https://www.productmanagement.ai/p/openais-product-lead-reveals-the",
      "category": "ai-product-strategy",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2025-09-28",
      "last_verified": "2026-01-22",
      "next_review": "2027-01-22",
      "confidence": 4,
      "author": "Moe Ali / Miqdad Jaffer",
      "source": "productmanagement.ai",
      "summary": "This article presents the 4D Method for building AI products: Discovery, Design, Development, and Deployment. The framework emphasizes that AI product development differs fundamentally from traditional software because problems can vanish as models advance, interfaces shape user trust expectations, and drift management requires continuous monitoring. The Discovery phase involves \"truth hunting across shifting landscapes\" using tools like the Discovery Debt Log and a 3-Lens test (durability, data, trust).\n\nThe Development and Deployment sections stress managing three types of drift—model, cost, and behavior—through golden datasets, monitoring, and escalation protocols. Rather than treating launch as an endpoint, teams must implement Day 2 infrastructure including dashboards, compliance automation, and rollback procedures. The article emphasizes building defensibility moats through distribution, trust, and rapid adaptation."
    },
    {
      "title": "AI Prototyping",
      "url": "https://www.productmanagement.ai/p/ai-prototyping",
      "category": "technical-skills",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2026-01-05",
      "last_verified": "2026-01-22",
      "next_review": "2026-04-22",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This guide teaches practitioners how to build effective AI prototypes through a structured, 12-step execution pipeline. Rather than creating impressive demos, it emphasizes treating prototypes as \"learning and discovery instruments designed to surface risk early.\" The methodology covers user triggers, hypothesis definition, prototype selection, orchestration logic, model invocation, output validation, evaluation metrics, cost measurement, failure testing, telemetry capture, and decision gates.\n\nThe content walks through a real AI Research Assistant prototype example, showing each step with actual screenshots and logging outputs. It targets product managers, founders, and engineers who understand basic AI concepts but need systematic frameworks for moving beyond \"prompting until it looks good,\" emphasizing that AI behavioral risk differs from traditional software feasibility concerns."
    },
    {
      "title": "Claude Code Masterclass",
      "url": "https://www.productmanagement.ai/p/ultimate-claude-code-masterclass",
      "category": "technical-skills",
      "level": "beginner",
      "format": "article",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2026-01-14",
      "last_verified": "2026-01-22",
      "next_review": "2026-04-22",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This article introduces Claude Code as a transformative tool for product managers and builders. It features testimonials from industry leaders demonstrating Claude Code's capabilities—including a Google engineer who states the tool generated in \"an hour\" what took his team a year to build. The content presents three practical applications: creating a personal PM copilot for daily task management, building production-ready prototypes from concept to launch, and converting Figma designs into functional code.\n\nThe article demonstrates specific use cases with detailed examples, such as building a meeting cost calculator and a Tinder-style swipe interface. It emphasizes how Claude Code eliminates technical barriers, enabling non-coders to automate workflows, scrape data, and generate prototypes through conversational AI interaction."
    },
    {
      "title": "Building AI as a System (Moats, Margins, etc)",
      "url": "https://www.productmanagement.ai/p/building-ai-as-a-system-moats-margins",
      "category": "business-economics",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2026-01-08",
      "last_verified": "2026-01-22",
      "next_review": "2027-01-22",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This article examines why most AI startups fail despite having access to identical technology as competitors. The authors argue that success depends not on flashy features but on strategic decisions about moats, unit economics, and pricing. They analyze cautionary tales like Chegg (lost 90% valuation), Jasper ($125M raised but lost market position), and Duolingo (user churn from poor AI integration). The core argument: \"AI doesn't forgive bad strategies\" because inference costs scale linearly with usage and commoditization happens in weeks rather than months.\n\nThe authors introduce a strategic framework comprising Direction (choosing defensible moats), Differentiation (surviving commoditization), Design (balancing adoption with cost efficiency), and Deployment (scaling without destroying margins). They address crucial topics including how AI marginal costs differ from SaaS, four pricing archetypes, and five common fatal mistakes founders make."
    },
    {
      "title": "AI Product Strategy 101",
      "url": "https://www.productmanagement.ai/p/how-to-create-an-ai-product-strategy",
      "category": "ai-product-strategy",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2025-12-16",
      "last_verified": "2026-01-22",
      "next_review": "2027-01-22",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This article presents a comprehensive framework for AI product strategy, arguing that success requires building defensible moats rather than simply adding AI features. The piece outlines three key lenses: identifying where to compete (Pioneer, Disruptor, or Enhancer), determining how to win through proprietary data and transformed workflows, and executing effectively while managing AI-specific challenges like cost-capability trade-offs and silent failures.\n\nThe content provides practical guidance through seven implementation steps and a detailed checklist, emphasizing that \"models are a commodity\" while \"data moats\" provide lasting competitive advantage. The author warns against three critical pitfalls: fighting giants head-on, relying on superficial demos, and building shallow wrappers on third-party APIs without proprietary differentiation."
    },
    {
      "title": "AI Product Strategy Advanced",
      "url": "https://www.productmanagement.ai/p/5-phases-ai-product-strategy",
      "category": "ai-product-strategy",
      "level": "expert",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2025-12-21",
      "last_verified": "2026-01-22",
      "next_review": "2027-01-22",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This article presents a comprehensive framework for building AI products strategically, organized into five sequential phases. It emphasizes that AI product strategy differs fundamentally from traditional SaaS, requiring focus on defensible moats (data, distribution, or trust) rather than just feature additions. The framework progresses through direction-setting, differentiation tactics, product architecture design, deployment strategies, and organizational leadership approaches.\n\nThe article addresses critical challenges unique to AI products, particularly the \"inference treadmill\" where increased user adoption directly increases operational costs. It advocates for structured experimentation through two-week sprints with clear hypotheses and measurable outcomes, warning against shipping half-built demos. Winning AI products require thoughtful architecture balancing adoption and cost efficiency, plus organizational alignment around long-term compounding advantages."
    },
    {
      "title": "AI Pricing",
      "url": "https://www.productmanagement.ai/p/the-ai-product-pricing-masterclass",
      "category": "business-economics",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "pricing",
      "access_type": "free",
      "publication_date": "2026-01-02",
      "last_verified": "2026-01-22",
      "next_review": "2026-07-22",
      "confidence": 4,
      "author": "Moe Ali / Miqdad Jaffer",
      "source": "productmanagement.ai",
      "summary": "This guide examines how AI product pricing fundamentally differs from traditional SaaS models. The authors explain that AI systems maintain perpetual, variable costs driven by user behavior rather than static marginal expenses. They introduce a seven-layer cost structure—including data preparation, retrieval, context construction, model execution, orchestration, concurrency, and evaluation—that compounds in unexpected ways. The piece emphasizes that \"pricing must absorb uncertainty\" and should be designed for worst-case scenarios.\n\nThe article presents four viable pricing models: usage-based (transparent but potentially growth-limiting), hybrid (combining subscriptions with overages), outcome-based (aligned but risky early-stage), and capacity-based (ideal for latency-sensitive systems). The authors stress that pricing decisions directly influence system architecture and user behavior patterns, providing decision trees, P&L frameworks, and a comprehensive cost glossary."
    },
    {
      "title": "AI Cost Optimisation",
      "url": "https://www.productmanagement.ai/p/the-ai-cost-optimisation-playbook",
      "category": "business-economics",
      "level": "expert",
      "format": "article",
      "status": "active",
      "content_type": "pricing",
      "access_type": "free",
      "publication_date": "2025-12-19",
      "last_verified": "2026-01-22",
      "next_review": "2026-07-22",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This comprehensive guide tackles the financial realities of scaling AI systems in production environments. It reveals that AI cost problems stem primarily from architectural inefficiencies rather than model pricing alone. The piece breaks down six cost layers (model, token, retrieval, orchestration, latency, and failure costs) and presents four optimization pillars: context compression, model right-sizing, retrieval efficiency, and execution optimization.\n\nThe guide provides enterprise governance frameworks covering observability dashboards, cost accountability structures, and organizational rituals to maintain cost discipline. It targets mid-to-senior level product and engineering leaders already operating AI systems at meaningful scale, emphasizing that scaling from prototype to production reveals hidden cost multipliers requiring systematic redesign rather than tactical tweaks."
    },
    {
      "title": "Context Engineering Masterclass",
      "url": "https://www.productmanagement.ai/p/the-ultimate-guide-to-context-engineering",
      "category": "technical-skills",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "model-dependent",
      "access_type": "free",
      "publication_date": "2025-12-24",
      "last_verified": "2026-01-22",
      "next_review": "2026-05-22",
      "confidence": 5,
      "author": "Miqdad Jaffer",
      "source": "productmanagement.ai",
      "summary": "This guide by Miqdad Jaffer (OpenAI Product Lead) establishes context engineering as the foundational discipline for building intelligent AI products. It argues that AI feature quality depends far more on context quality than model selection, presenting a \"Context Pyramid\" with six layers: Intent Context, User Context, Domain Context, Rule Context, Environment Context, and Exposition Context. The guide introduces the C.E.O. Framework (Capture, Enrich, Orchestrate) for operationalizing context at runtime.\n\nThe resource provides extensive practical tooling including checklists, templates, and example prompts that PMs can immediately deploy. Key themes include treating context as a durable competitive moat, designing graceful degradation when context fails, and separating what's structured versus unstructured in system design. Real-world examples illustrate how superior context architecture—not just better models—drives product superiority."
    },
    {
      "title": "Prompt Engineering Masterclass",
      "url": "https://www.productmanagement.ai/p/prompt-engineering",
      "category": "technical-skills",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "model-dependent",
      "access_type": "free",
      "publication_date": "2025-12-31",
      "last_verified": "2026-01-22",
      "next_review": "2026-05-22",
      "confidence": 5,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This comprehensive guide tackles prompt engineering as a systems discipline rather than a writing craft. The authors argue that most teams fail at prompting because they apply deterministic software thinking to probabilistic AI systems. The core insight is that effective prompts prevent bad reasoning paths rather than coax good outputs—requiring architects to minimize cognitive load, define explicit tradeoffs, and treat prompts like production infrastructure with versioning and governance.\n\nThe content progresses through five major sections: analyzing real system prompts from successful AI products, establishing the five-layer anatomy of great prompts, providing twelve actionable techniques with detailed examples, explaining how prompt entropy silently degrades AI quality over time, and sharing the mental paradigm shifts needed to build reliable systems. Throughout, the authors emphasize reducing surface area, isolating reasoning stages, and explicit failure policies."
    },
    {
      "title": "AI Distribution",
      "url": "https://www.productmanagement.ai/p/openais-product-leader-shares-3-layer",
      "category": "go-to-market",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2025-12-28",
      "last_verified": "2026-01-22",
      "next_review": "2027-01-22",
      "confidence": 4,
      "author": "Moe Ali / Miqdad Jaffer",
      "source": "productmanagement.ai",
      "summary": "This comprehensive article presents a strategic framework for distributing AI products in a competitive market. The core thesis is that \"Features get cloned. Models commoditize. But distribution compounds.\" The piece outlines a three-layer distribution system: the GTM wedge (precise market entry), PLG loops (viral growth mechanisms), and moat flywheels (defensible competitive advantages through data, workflow integration, or trust). The framework includes four wedge archetypes, seven product-led growth loops, three types of defensible moats, and practical playbooks for implementation.\n\nThe article extends beyond theory with actionable guidance including a seven-step distribution strategy playbook and nine advanced tactics used by billion-dollar founders. Real-world case studies examine Perplexity, Runway, GitHub Copilot, Anthropic, Clay, and Cluely to illustrate distribution principles. It emphasizes that winning companies deliberately design all three distribution layers simultaneously, embedding distribution into product design from inception rather than treating it as a post-launch activity."
    },
    {
      "title": "Prompt Optimization",
      "url": "https://www.productmanagement.ai/p/prompt-optimization-guide",
      "category": "technical-skills",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "model-dependent",
      "access_type": "free",
      "publication_date": "2026-01-18",
      "last_verified": "2026-01-22",
      "next_review": "2026-05-22",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This comprehensive guide addresses systematic decay in AI systems through structured prompt optimization practices. The article establishes that prompt degradation occurs naturally as surface area expands, cognitive branching multiplies, and instruction weights shift over time. It introduces five diagnostic axes (responsibility audit, surface area audit, priority conflicts, failure modes, and cost signatures) to identify root causes of AI system instability. The core argument is that \"every AI system decays unless you actively suppress entropy,\" requiring teams to treat prompts as critical infrastructure.\n\nThe guide presents an optimization lifecycle with eight stages: problem intake, error categorization, root cause isolation, refactor blueprinting, A/B testing, impact measurement, and governance implementation. Key practical strategies include reducing prompt surface area by 40-70% through deletion of non-functional language, externalizing knowledge to retrieval systems, and establishing strict output contracts. Five detailed case studies demonstrate real-world applications, showing cost reductions up to 70% and failure rate decreases of 35-50%."
    },
    {
      "title": "Claude Code Course for Product Managers",
      "url": "https://ccforpms.com/",
      "category": "technical-skills",
      "level": "beginner",
      "format": "course",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2026-01-01",
      "last_verified": "2026-01-22",
      "next_review": "2026-04-22",
      "confidence": 4,
      "author": "Carl Vellotti",
      "source": "ccforpms.com",
      "summary": "This free interactive course teaches product managers how to use Claude Code—Anthropic's CLI tool—for AI-powered PM work. Uniquely, the course is taught inside Claude Code itself rather than through traditional video or documentation formats. The curriculum covers four modules progressing from installation and fundamentals through advanced PM applications, completed over approximately 10-12 hours of hands-on work.\n\nThe course covers core technical skills (file operations, parallel agent processing, custom sub-agents, project memory) and applied PM work (PRD writing, user research synthesis, data analysis, competitive strategy, presentation creation). It positions Claude Code as workflow integration rather than a chatbot. Notably, no coding or terminal experience is required—if you can communicate in plain English, you can participate."
    },
    {
      "title": "How to Write a Great agents.md",
      "url": "https://github.blog/ai-and-ml/github-copilot/how-to-write-a-great-agents-md-lessons-from-over-2500-repositories/",
      "category": "technical-skills",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2025-11-19",
      "last_verified": "2026-01-22",
      "next_review": "2026-04-22",
      "confidence": 4,
      "author": "GitHub",
      "source": "GitHub Blog",
      "summary": "This GitHub Blog article analyzes best practices for creating `agents.md` files—configuration files that define custom AI agents for GitHub Copilot—based on patterns from over 2,500 repositories. The focus is on building effective specialized AI assistants with specific personas and clear operational guidelines rather than generic helpers.\n\nKey insights include: successful agents require specific personas (\"test engineer,\" not \"helpful assistant\"), executable commands, and concrete code examples. The most effective configurations include explicit constraints—what agents should never touch (secrets, vendor directories, production configs). The article identifies six core components for winning agents: commands, testing practices, project structure, code style, git workflows, and safety boundaries. It provides actionable templates and emphasizes iterative improvement over perfect upfront planning."
    },
    {
      "title": "Vibe Coding Masterclass",
      "url": "https://vibe-coding-masterclass.vercel.app/",
      "category": "technical-skills",
      "level": "beginner",
      "format": "course",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2025-12-01",
      "last_verified": "2026-01-22",
      "next_review": "2026-04-22",
      "confidence": 4,
      "author": "Shravan Tickoo",
      "source": "vibe-coding-masterclass.vercel.app",
      "summary": "This free online course teaches product managers how to build and deploy web applications using Claude Code without requiring traditional programming knowledge. Built by Shravan Tickoo (a PM with 10+ years experience), the curriculum spans 5 modules with 36+ lessons covering environment setup, AI-assisted development principles, prompting techniques, building complete applications, and deployment.\n\nReal-world projects include dashboards, landing pages, Chrome extensions, and API integrations. The course promises students can progress \"from idea to deployed app in a single session.\" The approach emphasizes that \"if you can describe what you want, Claude builds it\"—teaching practical skills for leveraging AI coding tools as a critical competency for modern product leaders."
    },
    {
      "title": "PM Vibe Code Operations Framework",
      "url": "https://github.com/bdouble/pm-vibecode-ops",
      "category": "technical-skills",
      "level": "intermediate",
      "format": "repository",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2025-11-21",
      "last_verified": "2026-01-22",
      "next_review": "2026-04-22",
      "confidence": 4,
      "author": "bdouble",
      "source": "GitHub",
      "summary": "This open-source workflow framework helps non-technical PMs and team leads transform product requirements into production-ready software using Claude Code or similar AI tools. The framework addresses a critical gap: while AI coding tools promise speed, they often produce unmaintainable results without proper structure. It provides \"the structure AI needs to help non-engineers move beyond prototypes and build production software reliably.\"\n\nThe system introduces six structural improvements: Service Inventory (catalogs existing code to prevent duplication), Adaptation Phase (guides AI on reusing services), Ticket Memory (leverages Linear/Jira as persistent AI context), Specialized Agents (deploys focused AI roles), Auto-Activated Quality Skills (enforces production standards during development), and Production-First Focus (eliminates workarounds). The framework claims 50-75% time savings on routine features while maintaining 90%+ test coverage with automated security review."
    },
    {
      "title": "Claude Code: Best Practices",
      "url": "https://www.anthropic.com/engineering/claude-code-best-practices",
      "category": "technical-skills",
      "level": "beginner",
      "format": "article",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2025-04-18",
      "last_verified": "2026-01-22",
      "next_review": "2026-04-22",
      "confidence": 5,
      "author": "Boris Cherny / Anthropic",
      "source": "Anthropic",
      "summary": "This official Anthropic engineering guide provides battle-tested patterns for using Claude Code effectively. It covers project customization through CLAUDE.md files to document commands, code style, and testing instructions that persist across sessions. The guide explains how to expand capabilities through bash environment variables, MCP servers, and custom slash commands.\n\nKey workflows include \"explore, plan, code, commit\" for structured development, test-driven approaches leveraging Claude's iterative capabilities, and visual iteration using screenshots. The article emphasizes that specific instructions yield better results than vague requests, and recommends extended thinking modes for complex problems. Advanced topics cover headless mode for CI/CD automation and multi-Claude workflows for parallel code review."
    },
    {
      "title": "Why Every PM Needs Claude Code",
      "url": "https://producttapas-newsletter.beehiiv.com/p/why-every-pm-needs-claude-code",
      "category": "technical-skills",
      "level": "beginner",
      "format": "article",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2025-12-01",
      "last_verified": "2026-01-22",
      "next_review": "2026-04-22",
      "confidence": 3,
      "author": "Alastair Preacher",
      "source": "ProductTapas",
      "summary": "This ProductTapas newsletter article advocates for Claude Code as an essential PM productivity tool. The author claims to have saved over 200 hours in 15 days by integrating Claude Code into their workflow, positioning it as more than just another AI tool—rather, a \"PM productivity multiplier.\"\n\nThe piece provides practical validation through real-world time savings, making it valuable for product managers evaluating AI solutions for their workflows. It emphasizes how Claude Code can streamline daily PM tasks, boost efficiency, and fundamentally change how product leaders approach their work."
    },
    {
      "title": "Context is the Next Data Platform",
      "url": "https://www.glean.com/blog/context-data-platform",
      "category": "technical-skills",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2025-11-01",
      "last_verified": "2026-01-22",
      "next_review": "2027-01-22",
      "confidence": 4,
      "author": "Arvind Jain",
      "source": "Glean",
      "summary": "This article by Glean CEO Arvind Jain argues that context graphs represent a critical evolution in how enterprises enable AI agents to function effectively. Rather than attempting to capture the \"why\" behind work decisions, the approach focuses on capturing the \"how\"—the observable digital trail of actions, collaborations, and state changes across enterprise tools.\n\nThe piece provides a practical framework for understanding what data layers matter most for AI reasoning, moving beyond simple document indexing to process-level understanding. Building effective context graphs requires a sophisticated technical stack including connectors for activity observation, semantic understanding of tasks and projects, and enterprise memory systems that learn from agent execution over time. This is essential reading for PMs developing enterprise AI platforms, agentic automation systems, or knowledge management tools."
    },
    {
      "title": "What I Wish I'd Known Before Building My First AI Agent",
      "url": "https://the-release-notes.beehiiv.com/p/what-i-wish-i-d-known-before-building-my-first-ai-agent",
      "category": "technical-skills",
      "level": "beginner",
      "format": "article",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "free",
      "publication_date": "2026-01-16",
      "last_verified": "2026-01-24",
      "next_review": "2027-01-24",
      "confidence": 4,
      "author": "Jake McCGwire",
      "source": "The Release Notes",
      "summary": "This article serves as a non-technical PM's guide to orchestrators, context optimization, and evals for AI agents. Author Jake McCGwire shares practical lessons learned from building AI agents, demystifying technical concepts for product managers who need to understand agent architecture without deep engineering knowledge.\n\nThe piece covers key concepts PMs encounter when working with AI agents, including orchestration patterns, how context impacts agent performance, and evaluation methodologies. It's designed to help product managers have informed conversations with engineering teams and make better product decisions around agent-based systems."
    },
    {
      "title": "ChatGPT Prompt Engineering for Developers",
      "url": "https://www.deeplearning.ai/short-courses/chatgpt-prompt-engineering-for-developers/",
      "category": "technical-skills",
      "level": "beginner",
      "format": "course",
      "status": "active",
      "content_type": "model-dependent",
      "access_type": "free",
      "publication_date": "2023-04-01",
      "last_verified": "2026-01-24",
      "next_review": "2026-05-24",
      "confidence": 4,
      "author": "Isa Fulford, Andrew Ng",
      "source": "DeepLearning.AI",
      "summary": "This free short course from DeepLearning.AI teaches how to use large language models through the OpenAI API. Taught by Isa Fulford (OpenAI) and Andrew Ng, it covers practical applications including summarizing, inferring sentiment, transforming text, and expanding content. The course runs approximately 1.5 hours with 9 video lessons and 7 code examples.\n\nWhile developer-focused, product managers benefit from understanding what prompt engineering can accomplish and its limitations. The course provides foundational knowledge about LLM capabilities that helps PMs communicate effectively with technical teams and set realistic expectations for AI features. Basic Python knowledge is helpful but not required to understand the concepts."
    },
    {
      "title": "LangChain for LLM Application Development",
      "url": "https://www.deeplearning.ai/short-courses/langchain-for-llm-application-development/",
      "category": "technical-skills",
      "level": "beginner",
      "format": "course",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2023-06-01",
      "last_verified": "2026-01-24",
      "next_review": "2026-04-24",
      "confidence": 4,
      "author": "Harrison Chase, Andrew Ng",
      "source": "DeepLearning.AI",
      "summary": "This free short course teaches how to build applications using the LangChain framework. Taught by Harrison Chase (LangChain creator) and Andrew Ng, it covers models, prompts, parsers, memory management, chains, question-answering over documents, and agents. The course runs approximately 1 hour 38 minutes with 8 video lessons and 6 code examples.\n\nProduct managers gain valuable insight into what's technically possible when building \"personal assistants and specialized chatbots\" and how to \"apply LLMs to proprietary data.\" Understanding LangChain's capabilities helps PMs scope features realistically and communicate requirements to engineering teams building LLM applications."
    },
    {
      "title": "LLMs as Operating Systems: Agent Memory",
      "url": "https://www.deeplearning.ai/short-courses/llms-as-operating-systems-agent-memory/",
      "category": "technical-skills",
      "level": "intermediate",
      "format": "course",
      "status": "active",
      "content_type": "model-dependent",
      "access_type": "free",
      "publication_date": "2024-09-01",
      "last_verified": "2026-01-24",
      "next_review": "2026-05-24",
      "confidence": 4,
      "author": "Letta",
      "source": "DeepLearning.AI",
      "summary": "This free short course teaches how to build AI agents with autonomous memory management using the Letta framework and MemGPT approach. Taught by Letta's co-founders, it covers building management systems for persistent memory, conversation memory control, fact persistence, and multi-agent collaboration. The course runs approximately 1 hour 22 minutes with 8 video lessons and 5 code examples.\n\nProduct managers overseeing agent-based products benefit from understanding how memory constraints shape agent capabilities and user experiences. The course explains why agents need persistent memory for complex tasks and how memory architecture affects product design decisions."
    },
    {
      "title": "Multi AI Agent Systems with crewAI",
      "url": "https://www.deeplearning.ai/short-courses/multi-ai-agent-systems-with-crewai/",
      "category": "technical-skills",
      "level": "beginner",
      "format": "course",
      "status": "active",
      "content_type": "tool-specific",
      "access_type": "free",
      "publication_date": "2024-05-01",
      "last_verified": "2026-01-24",
      "next_review": "2026-04-24",
      "confidence": 4,
      "author": "crewAI",
      "source": "DeepLearning.AI",
      "summary": "This free short course teaches how to design teams of AI agents that collaborate on complex tasks. Students learn to define specific roles, goals, and backstories for each agent and apply these principles to automate business processes like resume tailoring, article writing, customer support, and financial analysis. The course runs approximately 2 hours 41 minutes with 18 video lessons and 7 code examples.\n\nProduct managers benefit from understanding multi-agent system design patterns and real-world applications. The course demonstrates how orchestrated agent teams can tackle workflows that single agents cannot, helping PMs evaluate when multi-agent architectures make sense for their products."
    },
    {
      "title": "Building and Evaluating Advanced RAG",
      "url": "https://www.deeplearning.ai/short-courses/building-evaluating-advanced-rag/",
      "category": "technical-skills",
      "level": "beginner",
      "format": "course",
      "status": "active",
      "content_type": "model-dependent",
      "access_type": "free",
      "publication_date": "2024-02-01",
      "last_verified": "2026-01-24",
      "next_review": "2026-05-24",
      "confidence": 4,
      "author": "Jerry Liu, Anupam Datta",
      "source": "DeepLearning.AI",
      "summary": "This free short course teaches advanced techniques for Retrieval Augmented Generation (RAG) systems. Taught by Jerry Liu (LlamaIndex CEO) and Anupam Datta (Snowflake), it covers sentence-window retrieval, auto-merging retrieval, and the RAG evaluation triad: Context Relevance, Groundedness, and Answer Relevance. The course runs approximately 1 hour 55 minutes with 6 video lessons and 4 code examples.\n\nProduct managers overseeing RAG-powered features benefit from understanding how retrieval quality impacts output quality and how to evaluate RAG systems. The evaluation framework helps PMs define success metrics and quality gates for AI features that rely on document retrieval."
    },
    {
      "title": "Getting a $180K–$569K AI PM Role",
      "url": "https://www.productmanagement.ai/p/your-complete-roadmap-to-earning",
      "category": "career",
      "level": "intermediate",
      "format": "article",
      "status": "active",
      "content_type": "career",
      "access_type": "paid",
      "access_notes": "55% free preview, 45% paywalled",
      "publication_date": "2026-01-11",
      "last_verified": "2026-01-24",
      "next_review": "2026-07-24",
      "confidence": 4,
      "author": "Moe Ali",
      "source": "productmanagement.ai",
      "summary": "This comprehensive guide outlines a systematic approach to landing high-paying AI Product Manager positions. It establishes that companies aren't simply hiring PMs who can use AI tools, but rather individuals who can \"design, architect, and scale intelligent systems\" end-to-end. The roadmap covers seven core competencies: context depth, intelligent interface design, agentic workflow thinking, technical intuition, ML strategy judgment, data moat understanding, and executive communication.\n\nThe guide provides actionable frameworks across multiple dimensions: a three-project portfolio system (workflow reimagination, agentic architecture, and intelligent UX prototype), detailed interview preparation covering twelve key evaluation signals, resume and LinkedIn optimization strategies, and a practical 30-60-90 day job search plan. The overall philosophy centers on \"Lead With Proof, Not With Desire\"—establishing credibility through tangible work rather than credentials.\n\nNote: Free preview covers approximately 55% of content. Premium sections covering resume frameworks, job search strategies, and cold outreach templates require paid subscription."
    },
    {
      "title": "Generative AI for Everyone",
      "url": "https://www.deeplearning.ai/courses/generative-ai-for-everyone/",
      "category": "ai-fundamentals",
      "level": "beginner",
      "format": "course",
      "status": "active",
      "content_type": "conceptual",
      "access_type": "paid",
      "access_notes": "Paid enrollment required",
      "publication_date": "2023-09-01",
      "last_verified": "2026-01-24",
      "next_review": "2027-01-24",
      "confidence": 4,
      "author": "Andrew Ng",
      "source": "DeepLearning.AI",
      "summary": "This introductory course by AI pioneer Andrew Ng teaches how generative AI works and its practical applications. The curriculum covers understanding LLMs, prompt engineering, real-world use cases, and AI's impact on business and society. Students learn what generative AI \"can (and can't) do\" and explore advanced techniques beyond basic prompting including RAG and fine-tuning.\n\nThe course specifically targets business leaders seeking to understand how generative AI impacts organizations and develop AI strategies. No prior knowledge of AI or coding skills required. It balances technical fundamentals with practical business applications, making it ideal for product managers who need to understand AI capabilities and limitations for strategic decision-making."
    }
  ],
  "rejected": [
    {
      "title": "Awesome Claude Code Subagents",
      "url": "https://github.com/VoltAgent/awesome-claude-code-subagents",
      "date_evaluated": "2026-01-21",
      "reason": "Reference library, not learning resource"
    },
    {
      "title": "From Local to Global: A Deep Dive into GraphRAG",
      "url": "https://blog.gopenai.com/from-local-to-global-a-deep-dive-into-graphrag-1c50e2fc9e65",
      "date_evaluated": "2026-01-22",
      "reason": "Too technical for PM audience; focuses on engineering implementation details"
    },
    {
      "title": "Twitter Thread (affaanmustafa)",
      "url": "https://x.com/affaanmustafa/status/2012378465664745795",
      "date_evaluated": "2026-01-24",
      "reason": "Content inaccessible; X/Twitter blocked automated fetching"
    },
    {
      "title": "Preprocessing Unstructured Data for LLM Applications",
      "url": "https://www.deeplearning.ai/short-courses/preprocessing-unstructured-data-for-llm-applications/",
      "date_evaluated": "2026-01-24",
      "reason": "Too technical for PM audience; focuses on data preprocessing implementation"
    },
    {
      "title": "Fundamentals of AI Agents Using RAG and LangChain",
      "url": "https://www.coursera.org/learn/fundamentals-of-ai-agents-using-rag-and-langchain",
      "date_evaluated": "2026-01-24",
      "reason": "Requires Python/PyTorch experience; too technical for PM audience"
    },
    {
      "title": "Build Autonomous AI Agents from Scratch with Python",
      "url": "https://www.udemy.com/course/build-autonomous-ai-agents-from-scratch-with-python/",
      "date_evaluated": "2026-01-24",
      "reason": "Developer-focused Python course; not relevant for PM learning path"
    },
    {
      "title": "Building Intelligent Troubleshooting Agents",
      "url": "https://www.coursera.org/learn/building-intelligent-troubleshooting-agents",
      "date_evaluated": "2026-01-24",
      "reason": "45-hour Microsoft engineering course; too technical for PM audience"
    }
  ]
}
